---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.EndShortening
source: html/2c5ecd7f-a530-4058-bfcc-cbb4a681cd09.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.EndShortening Property

Cutback or extension at element curve end.

## Syntax (C#)
```csharp
public double EndShortening { get; }
```